---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyRotateWithComponent
source: html/f86ed4c4-1d99-17ba-621c-e6c97e160e13.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyRotateWithComponent Property

"Rotate with component"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyRotateWithComponent { get; }
```